"According to R. C. Bell, the earliest known board for the game includes diagonal lines and was \"cut into the roofing slabs of the temple at Kurna in Egypt\"; he estimated a date for them of c. 1400 BCE.[13] Friedrich Berger wrote that some of the diagrams at Kurna include Coptic crosses, however, making it \"doubtful\" that the diagrams date to 1400 BCE. Berger concluded: \"Certainly they cannot be dated.\" One of the earliest mentions of the game may be in Ovid's Ars Amatoria. In book III (c. 8 CE), after discussing latrones, a popular board game, Ovid wrote: There is another game divided into as many parts as there are months in the year. A table has three pieces on either side; the winner must get all the pieces in a straight line. It is a bad thing for a woman not to know how to play, for love often comes into being during play. Berger believes the game was \"probably well known by the Romans\", as there are many boards on Roman buildings, even though dating them is impossible because the buildings \"have been easily accessible\" since they were built. It is possible that the Romans were introduced to the game via trade routes, but this cannot be proven. A 13th-century illustration in Libro de los juegos of the game being played with dice An early gaming table (Germany, 1735) featuring chess/draughts (left) and nine men's morris (right), Cleveland Museum of Art The game might have been played by the sculptors while they were building the huge temples. Inscriptions are seen in many places, carved on stone. The game peaked in popularity in medieval England. A brick found on a mediaeval site near Wisbech, had been used by the brickmakers as a board before being fired. Boards have been found carved into the cloister seats at the English cathedrals at Canterbury, Gloucester, Norwich, Salisbury and Westminster Abbey. These boards used holes, not lines, to represent the nine spaces on the board—hence the name \"nine holes\"—and forming a diagonal row did not win the game. Another board is carved into the base of a pillar in Chester Cathedral in Chester. Giant outdoor boards were sometimes cut into village greens. In Shakespeare's 17th century work A Midsummer Night's Dream, Titania refers to such a board: \"The nine men's morris is filled up with mud\". Some authors say the game's origin is uncertain. It has been speculated that its name may be related to Morris dances, and hence to Moorish, but according to Daniel King, \"the word 'morris' has nothing to do with the old English dance of the same name. It comes from the Latin word merellus, which means a counter or gaming piece.\" King also notes that the game was popular among Roman soldiers. In some European countries, the design of the board was given special significance as a symbol of protection from evil."